In [24]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.ext.automap import automap_base
from sqlalchemy import create_engine, func

In [25]:
#Luke connection
path_string = "postgres:postgres@localhost:5432/energy"
engine = create_engine(f"postgresql://{path_string}")

Base = automap_base()
Base.prepare(engine, reflect=True)

Base.classes.keys()

[]

In [26]:
# engine.execute("SELECT * FROM energy_data;").fetchall()

In [27]:
#build and execute energy query
sources=['Wind','Petroleum']
year = 1990

in_string = ""
query_string =f'select state_id, sum (generation_megawatthours) from energy_data where energy_source in ('

for i in sources:
    if i == sources[0]:
        in_string += f'\'{i}\''
        continue
    in_string += f',\'{i}\''

query_string += in_string +f') and year_energy = {year} group by state_id'

print(query_string)

results_energy = pd.read_sql(query_string, con=engine).rename(columns={'sum':'megawatthours'})

results_energy.head()

select state_id, sum (generation_megawatthours) from energy_data where energy_source in ('Wind','Petroleum') and year_energy = 1990 group by state_id

  state_id  megawatthours
0       AK       994232.0
1       AL       276178.0
2       AR       159958.0
3       AZ       303734.0
4       CA     16465466.0

In [28]:
#execute population query
results_population = pd.read_sql(f'select state_id, population from population_data where year_population = {year}',con=engine)
results_population.head()

  state_id  population
0       AL     4050055
1       AK      553290
2       AZ     3684097
3       AR     2356586
4       CA    29959515

In [33]:
results = pd.merge(results_energy, results_population, on = "state_id")
results.head()

  state_id  megawatthours  population
0       AK       994232.0      553290
1       AL       276178.0     4050055
2       AR       159958.0     2356586
3       AZ       303734.0     3684097
4       CA     16465466.0    29959515

In [39]:
results_dict = results.to_dict('records')
results_dict[:4]

[{'state_id': 'AK', 'megawatthours': 994232.0, 'population': 553290},
 {'state_id': 'AL', 'megawatthours': 276178.0, 'population': 4050055},
 {'state_id': 'AR', 'megawatthours': 159958.0, 'population': 2356586},
 {'state_id': 'AZ', 'megawatthours': 303734.0, 'population': 3684097}]